#include<stdio.h>
#define P 2
#define R 3
#define C 5

int main()
{
	// 3차원 배열선언 및 초기화
	int index[P][R][C] = {
		// 0면
		{
			{1, 2, 3, 4, 5},
			{6, 7, 8, 9, 10},
			{11, 12, 13, 14, 15}
		},

		// 1면
		{
			{16, 17, 18, 19, 20},
			{21, 22, 23, 24, 25},
			{26, 27, 28, 29, 30}
		}
	};


	// 트리플 루프를 사용하여 배열의 값을 출력
	// 면 출력
	for (int i = 0; i < P; i++)
	{
		printf("-------------------------------------------------------------------------------------------------\n");
		printf("[%d면] 출력\n", i);

		// 행 출력
		for (int j = 0; j < R; j++)
		{
			printf("[%d행]...", j);
			// 열 출력
			for (int k = 0; k < C; k++)
			{
		
				printf(" {%2d},", index[i][j][k]);
				printf("[%d][%d][%d]", i, j, k);
			}
			printf("\n");
		}
	}
	return 0;
}